cases/doc-g1-sim1/fluid/system/changeDictionaryDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
boundary
{
    front { type empty; }
    back  { type empty; }
    wall  { type wall; }
    tm_se_wall { type wall; }
    inlet_demote_wall { type wall; }
    demote_wall { type wall; }
    lens_wall { type wall; }
    iris_wall { type wall; }
    ac_inlet { type patch; }
    ac_inlet_left { type patch; }
    outlet_tm { type patch; }
    outlet_tm_left { type patch; }
}
