cases/doc-g1-sim1/fluid/system/createPatchDict.frontBack
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

pointSync false;
patches
(
    {
        name front;
        patchInfo { type empty; }
        constructFrom set;
        set frontFaces;
    }
    {
        name back;
        patchInfo { type empty; }
        constructFrom set;
        set backFaces;
    }
);
