cases/doc-g1-sim1/fluid/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

// Anatomical G1 Step 0 — prism mesh (max nonOrtho ~66°) needs non-ortho correctors.

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.01;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 20;
        mergeLevels     1;
        maxIter         100;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|UFinal)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 3;

    residualControl
    {
        p               1e-4;
        U               1e-5;
    }
}

relaxationFactors
{
    fields
    {
        p               0.2;
    }
    equations
    {
        U               0.5;
    }
}
